{"bio-dynamic brown rice":"Bio Dynamic is an enhanced method of Certified Organic farming that concentrates on enhancing soil, plant, and environmental health and vitality. This brown rice is entirely rain-fed and grown without any input from flood irrigation.",
"sumac onions":"Ground sumac is a spice popular in Middle Eastern and Mediterranian cooking. It has a mild flavor and doesn't overpower dishes the way some other strong spices do.",
"rosti":"a Swiss dish of grated potatoes formed into a small flat cake and fried.",
"patissiere":"a thick, creamy custard used as a filling for cakes and pastries.",
"marmelade":"Marmalade generally refers to a fruit preserve made from the juice and peel of citrus fruits boiled with sugar and water. It can be produced from kumquats, lemons, limes, grapefruits, mandarins, sweet oranges, bergamots, and other citrus fruits, or any combination of them.",
"Fior di latte":"semi-soft, fresh cheese made in the style of Italian mozzarella.",
"truffle":"a strong-smelling underground fungus that resembles an irregular, rough-skinned potato, growing chiefly in broadleaved woodland on calcareous soils. It is considered a culinary delicacy and found, especially in France, with the aid of trained dogs or pigs.",
"milk crumb":"a dried, crystallized mixture made from milk and sugar",
"stracciatella":"an Italian soup containing eggs and cheese",
"terrine":"a meat, fish, or vegetable mixture that has been cooked or otherwise prepared in advance and allowed to cool or set in its container, typically served in slices",
"pangratatto":"crisp Italian breadcrumbs.",
"marjoram":"another word for oregano. An aromatic herb with a robust flavor that's pungent, spicy, and slightly bitter.",
"radicchio":"chicory of a variety which has dark red leaves.",
"meringue":"an item of sweet food made by baking a mixture of stiffly beaten egg whites and sugar until crisp",
"Salsa Picante":"spicy sauce, often with a thinner consistency than typical salsa.",
"kholrabi":"a cabbage of a variety with an edible turnip-like swollen stem.",
"chutney":"a spicy condiment of Indian origin, made of fruits or vegetables with vinegar, spices, and sugar.",
"tapioca":"a starchy substance in the form of hard white grains, obtained from cassava and used in cooking for puddings and other dishes.",
"edoes":"a root vegetable similar to yams and potato, but with a more sticky and starchy texture.",
"monfongo":"a mashed mound of plantains into which a combination of seafood, meat or vegetables is added.",
"jerusalem artichoke":"a knobbly edible tuber with white flesh, eaten as a vegetable.",
"beef jugo":"a concentrated flavorful broth of beef meat finely diced and served with beans plus a wide array of toppings served alongside.",
"dulce de leche":"a confection prepared by slowly heating sweetened milk to create a substance that derives its flavor from the Maillard reaction, also changing color, with an appearance and flavor similar to caramel.",
"bonito":"a small tuna with dark oblique stripes on the back.",
"murasaki":"purple sweet potato. ",
"panacotta":"a cold Italian dessert made with double cream.",
"snow pea tendrils":"also known as pea shoots, are the young leaves, stems, vines, and flowers of a pea plant. ",
"tsuyu":"thin, clear sauce is made from dashi soup stock and a mixture of soy sauce, mirin and sugar, which is called 'kaeshi'.",
"Bulgogi beef":"\"fire meat\", is a gui (Korean-style grilled or roasted dish) made of thin, marinated slices of beef or pork grilled on a barbecue or on a stove-top griddle.",
"yuzu":"a round, yellowish citrus fruit with fragrant, acidic juice, used chiefly as a flavouring",
"parfait":"a rich cold dessert made with whipped cream, eggs, and fruit. Or a rich pâté with a very smooth consistency.",
"hemp seed":"A source of great protein; the seeds of an Asian plant which are rich in healthy fats and essential fatty acids. ",
"miso":"paste made from fermented soya beans and barley or rice malt, used in Japanese cooking.",
"tahini":"a Middle Eastern paste or spread made from ground sesame seeds.",
"semifreddo":"a light semi-frozen Italian dessert.",
"buckwheat":"an Asian plant cultivated for its grain-like seeds and has a slightly bitter flavour.",
"zaatar":"Originally in the Middle East: any of a number of aromatic culinary herbs.",
"rhubarb":"the thick reddish or green leaf stalks of a cultivated plant of the dock family, which are eaten as a fruit after cooking",
"guacamole":"a dish of mashed avocado mixed with chopped onion, tomatoes, chilli peppers, and seasoning.",
"mustard fruit":"Mustard Fruit or 'Mostarda di frutta' originating from Cremona in Italy, this a condiment made from poaching fruits in a mustard flavoured syrup. Traditionally Mustard Fruit is served with cold meats and cheese or used as a way of adding a spicy sweetness to a dish.",
"verjus":"the tart, fresh juice of unripe wine grapes. It is a culinary ingredient indigenous to the world's wine producing regions that is used in sauce making, for poaching fish and meat, and to dress lettuces, vegetables and fruit.",
"sherbet":"a flavoured sweet effervescent powder eaten alone or made into a drink",
"lardo":"Lardo is a type of salumi made by curing strips of fatback with rosemary and other herbs and spices. ",
"tobiko":"Tobiko is the Japanese word for flying fish roe. It is most widely known for its use in creating certain types of sushi. The eggs are small, ranging from 0.5 to 0.8 mm. For comparison, tobiko is larger than masago, but smaller than ikura.",
"truffle oil":"Oil flavoured with truffles, used in cooking.",
"sea urchin":"a marine echinoderm having a spherical or flattened shell covered in mobile spines, with a mouth on the underside and calcareous jaws.",
" Yuzu":"a round, yellowish citrus fruit with fragrant, acidic juice, used chiefly as a flavouring",
"béchamel":"a rich white sauce made with milk infused with herbs and other flavourings.",
"Dijon":"an industrial city in east central France, the capital of Burgundy; population 155,340 (2006).",
"gruyere":"a firm, tangy cheese.",
"sorrel":"a European plant of the dock family, with arrow-shaped leaves that are used in salads and cooking for their acidic flavour.",
"witlof":"a vegetable with white leaves that taste bitter and are eaten uncooked in salads.",
"croquette":"a small ball or roll of vegetables, minced meat, or fish, fried in breadcrumbs",
"Chinese donut":"Youtiao, also known as Chinese fried churros, Chinese cruller, Chinese oil stick, Chinese doughnut, You Char Kway/Cakwe/Cakoi/Kueh/Kuay (in Malaysia, Indonesia, and Singapore), and fried breadstick, is a long golden-brown deep-fried strip of dough eaten in China and (by a variety of other names) in other East and Southeast Asian cuisines.",
"wagyu":"any of several breeds of Japanese cattle producing tender, marbled beef that typically contains a high percentage of saturated fat.",
"dry-cured":"to cure (meat or fish) with salt rather than in liquid.",
"salmon roe":"Roe or hard roe is the fully ripe internal egg masses in the ovaries, or the released external egg masses of fish and certain marine animals, such as shrimp, scallop and sea urchins.",
"levage":"Herb; The leaves can be used in salads, or to make soup or season broths, and the roots can be eaten as a vegetable or grated for use in salads. Its flavor and smell can be described as a mix of celery and parsley, but with a higher intensity of both of those flavors.",
"quince":"a hard, acid pear-shaped fruit used in preserves or as flavouring",
"taleggio":"a type of soft Italian cheese made from cow's milk.",
"brûlée":"a dessert of custard topped with caramelized sugar; crème brûlée",
"salmon rillette":"Rillettes are a preparation of meat similar to pâté. Commonly made from pork, the meat is cubed or chopped, salted heavily and cooked slowly in fat, shredded, and then cooled with enough of the fat to form a paste.",
"Pearl barley":"barley reduced to small round grains by grinding.",
"farro":"a type of hulled wheat, especially spelt or emmer, typically used in salads, soups, and side dishes",
"compote":"fruit preserved or cooked in syrup.",
"polenta":"maize flour as used in Italian cooking; cornmeal.",
"fior di latte":"semi-soft, fresh cheese made in the style of Italian mozzarella.",
"chimichurri":"(in Argentinian cooking) a piquant sauce or marinade traditionally used on grilled meat, typically containing parsley, garlic, vinegar, olive oil, and flakes of chilli pepper",
"vierge":"French sauce made from olive oil, lemon juice, chopped tomato and chopped basil.",
"shanklish":"Shanklish, also known as chancliche, shinklish, shankleesh, sorke, or sürke, is a type of cow's milk or sheep milk cheese in Levantine cuisine. It is typically formed into balls of approximately 6 cm diameter, which are often covered in za'atar and Aleppo pepper, and then aged and dried.",
"wombok":"Wombok, also known as Chinese cabbage, is the sweet cousin in the cabbage family. Though wombok is best recognised for it's use in Asian cuisine, the mild, sweet flavour also makes it one of the most versatile members of the family.",
"nori":"an edible seaweed eaten either fresh or dried, especially by the Japanese.",
"matcha":"powdered green tea leaves, dissolved in hot water to make tea or used as a flavouring",
"coulis":"a thin fruit or vegetable puree, used as a sauce",
"Açai":"a small, dark purple, berrylike fruit with a juicy pulp; often used in beverages or eaten raw; native to tropical rain forests of Central and South America.",
"silken tofu":"Silken tofu can have different consistencies depending on how much soy protein it contains. It is often labeled soft, firm, or extra firm. Silken tofu works well in creamy and blended foods like smoothies, desserts, puddings, salad dressings, sauces, and dips. ",
"wakame":"an edible brown seaweed used, typically in dried form, in Chinese and Japanese cooking.",
"nori salt":"Nori is the Japanese name for edible seaweed species of the red algae genus Pyropia, including P. yezoensis and P. tenera. It has a strong and distinctive flavor. It is used chiefly in Japanese cuisine as an ingredient to wrap rolls of sushi or onigiri, in which case the term refers to the dried sheets.",
"Triticale":"a hybrid cereal produced by crossing wheat and rye, grown as a fodder crop.",
"aquafaba":"water in which chickpeas or other pulses have been cooked, used as a substitute for egg whites, particularly in vegan cooking",
"praline":"a smooth, sweet substance made by boiling nuts in sugar and grinding the mixture, used especially as a filling for chocolates",
"vinaigrette":"salad dressing of oil, wine vinegar, and seasoning.",
"scamorza":"a mild white Italian cheese made from cow's or buffalo's milk, produced in small gourd-shaped balls.",
"daikon":"(another term for mooli) a radish of a variety with a large slender white root which is typically eaten cooked, especially in Eastern cuisine.",
"shiso":"a plant of the mint family, native to eastern Asia, used as a herb in Japanese cooking.",
"manchego":"a Spanish cheese traditionally made with sheep's milk.",
"gram flour":"a type of flour made by grinding dried chickpeas, widely used in Indian cooking",
"mackerel":"an important food fish with a rich source of omega 3 fatty acids",
"bhaji":"(in Indian cuisine) a small flat cake or ball of vegetables, fried in batter.",
"Idli":"a south Indian steamed cake of rice, usually served with sambhar.",
"tamarind":"the tropical African tree which yields tamarind pods, cultivated throughout the tropics and also grown as an ornamental and shade tree. Sticky brown acidic pulp from the pod of a tree of the pea family, widely used as a flavouring in Asian cooking.",
"dukkah":"an Egyptian condiment consisting of a mixture of herbs, nuts (usually hazelnut), and spices. It is typically used as a dip with bread or fresh vegetables for an hors d'œuvre.",
"pimento":"a variety of large, red, heart-shaped chili pepper. It is sweet, succulent, and more aromatic than that of the red bell pepper.",
"hibiscus":"a plant of the mallow family, grown in warm climates for its large brightly coloured flowers or for products such as fibre or timber.",
"ranchero sauce":"A piquant tomato-based sauce that incluces onions, green chilis and seasonings",
"finger lime":"or caviar lime, is a thorny understorey shrub or small tree of lowland subtropical rainforest. Found in the coastal border region of Queensland and New South Wales, Australia.",
"dijonnaise":"The term \"Dijonnaise\" refers to a blend of Dijon mustard with mayonnaise.",
"baby bok choy":"Bok choy, pak choi or pok choi is a type of Chinese cabbage. Chinensis varieties do not form heads and have smooth, dark green leaf blades instead, forming a cluster reminiscent of mustard greens or celery.",
"levage":"Herb; The leaves can be used in salads, or to make soup or season broths, and the roots can be eaten as a vegetable or grated for use in salads. Its flavor and smell can be described as a mix of celery and parsley, but with a higher intensity of both of those flavors.",
"paté":"A spread or paste made from finely chopped or pureed seasoned meat",
"ous-vide":"A method of cooking in which food is placed in a plastic pouch (vacuum-sealed) or glass and cooked in a temperature controlled water bath",
"szechuan":"A spicy Chinese sauce with bold flavours derived from Sichuan pepper",
"rose syrup":"Rose hips or rose petals simmered, mashed and then strained to produce a sugar syrup",
"enokis":"Long, thin and white Japanese mushrooms",
"soft shell crab":"a culinary term for crabs that have recently molted their old exoskeleton and are still soft. Soft-shells are removed from the water as soon as they molt to prevent any hardening of their shell.",
"queso fresco":"a creamy, soft, and mild unaged white cheese",
"freekah":"a cereal food made from unripened wheat that has been roasted and crushed into small pieces, used especially in Middle Eastern cooking.",
"broccolini":"a green vegetable similar to broccoli but with smaller florets and longer, thin stalks.",
"hollandaise":"a creamy sauce of melted butter, egg yolks, and vinegar, served especially with fish.",
"ancient grains":"a grouping of grains and pseudocereals that are considered to have been little changed by selective breeding over recent millennia, as opposed to more widespread cereals such as corn, rice and modern varieties of wheat, which are the product of thousands of years of selective breeding.",
"brioche bun":"a light, sweet bun or roll made with eggs, yeast, and butter.",
"pepitas":"a pumpkin seed, typically hulled and roasted and eaten as a snack or used in cooking.",
"jamon":"top quality cut of dry-cured Spanish ham",
"buckini":"Activated buckwheat, an Asian plant of the dock family, producing starchy seeds that are used for fodder and also milled into flour which is widely used in the US.",
"torrija":"a spanish french toast",
"tom yum mayo":"made from an aggregation of spices and herbs — lemongrass, shallots, galangal, chili, dried shrimp, lime juice, kaffir lime leaves, and garlic — that commonly define Thai cuisine.",
"macerated":"(especially with reference to food) soften or become softened by soaking in a liquid.",
"haloumi":"a mild, firm white Cypriot cheese used especially in cooked dishes.",
"babaganoush":"a thick sauce or spread made from pureed aubergines and sesame seeds, typical of eastern Mediterranean cuisine.",
"pilpil":"A sauce of Basque origin made from olive oil, garlic and chili.",
"kaffir lime leaves":"an Asian citrus tree, Citrus hystrix, having green fruit with wrinkly skin and aromatic leaves that are used in Thai and Indonesian cookery.",
"house-cured":"The act or process of preserving a product in house; \"house-cured hams\"",
"pomegranate molasse":"a thick, sweet, sticky syrup that's used to flavor Mediterranean and Middle Eastern cuisine.",
"blue cheese":"cheese containing veins of blue mould, such as Stilton and Danish Blue.",
"marmalade":"Marmalade generally refers to a fruit preserve made from the juice and peel of citrus fruits boiled with sugar and water. It can be produced from kumquats, lemons, limes, grapefruits, mandarins, sweet oranges, bergamots, and other citrus fruits, or any combination of them.",
"marjoram":"another word for oregano. An aromatic herb with a robust flavor that's pungent, spicy, and slightly bitter.",
"cachaca":"a Brazilian white rum made from sugar cane.",
"hempseed":"the seed of hemp, particularly as used for fishing bait.",
"miso":"paste made from fermented soya beans and barley or rice malt, used in Japanese cooking.",
"bresaola":"an Italian dish of raw beef cured by salting and air-drying, typically served in slices with an olive oil, lemon juice, and pepper dressing.",
"confit":"duck or other meat cooked very slowly in its own fat.",
"roti":"bread, especially a flat round bread cooked on a griddle",
"caponata":"a dish of aubergines, olives, and onions seasoned with herbs, served as an appetizer.",
"braised":"(of food) fried lightly and then stewed slowly in a closed container",
"fingerlime":"Citrus australasica, the Australian finger lime or caviar lime, is a thorny understorey shrub or small tree of lowland subtropical rainforest and rainforest in the coastal border region of Queensland and New South Wales, Australia. It has edible fruits which are under development as a potential new commercial crop.",
"guindilla":"the guindilla pepper is a favorite chili in the Basque region of Spain. With a gentle spice and a narrow elongated frame, the guindilla is popular pickled in white wine vinegar and served as tapas or as a side with wine and cheese.",
"bottarga":"salted and dried tuna or grey mullet roe.",
"levage":"Herb; The leaves can be used in salads, or to make soup or season broths, and the roots can be eaten as a vegetable or grated for use in salads. Its flavor and smell can be described as a mix of celery and parsley, but with a higher intensity of both of those flavors.",
"ragu":"(in Italian cooking) a sauce typically made with minced meat, onions, tomato puree, and red wine, and served with pasta",
"pistou":"sauce or paste made from crushed basil, garlic, and cheese, used especially in Provençal dishes.",
"kimchi":"a Korean dish of spicy pickled cabbage.",
"ponzu dressing":"Ponzu is a citrus-based sauce commonly used in Japanese cuisine. It is tart, with a thin, watery consistency and a dark brown color. Ponzu shōyu or ponzu jōyu is ponzu sauce with soy sauce added, and the mixed product is widely referred to as simply ponzu.",
"Saffron":"an orange-yellow flavouring, food colouring, and dye made from the dried stigmas of a crocus.",
"goji berries":"A small red berry, believed to have health benefits and is traditionally used in Chinese medicine.",
"bok choy":"Bok choy, pak choi or pok choi is a type of Chinese cabbage. Chinensis varieties do not form heads and have smooth, dark green leaf blades instead, forming a cluster reminiscent of mustard greens or celery.",
"romesco":"(in Spanish cooking) a piquant sauce of red peppers, nuts, garlic, and olive oil",
"goats curd":"A dairy product made from coagulating the freshest goat milk in a process called curdling",
"rocket kale pesto":"A savory green Italian sauce made from blending mainly rocket and kale",
"beerios":"The combination of beer and cheerios (cereal)",
"kasundi":"An Asian or Bengali version of mustard paste (Indian relish)",
"inca berries":"Also known as the 'golden berry', it is one of the many newly discovered sweet superfoods which is packed with nature's nutrients (high in fibre and antioxidants)",
"turmeric":"A bright yellow aromatic powder obtained from a flowering plant of the ginger family. ",
"edamame":"A Japanese dish of salted green soybeans boiled in their pods, typically served as a snack or appetizer.",
"soba noodles":"Thin Japanese noodles made from buckwheat flour",
"cordyceps":"Also known as 'medical mushroom' is a fungi with several health benefits",
"cointreau":"a colourless orange-flavoured liqueur.",
"Falafel":"a Middle Eastern dish of spiced mashed chickpeas or other pulses formed into balls or fritters and deep-fried, usually eaten with or in pitta bread.",
"falafel":"a Middle Eastern dish of spiced mashed chickpeas or other pulses formed into balls or fritters and deep-fried, usually eaten with or in pitta bread.",
"sumac":"The sumac bush, native to the Middle East, produces deep red berries, which are dried and ground into coarse powder. Ground sumac is a versatile spice with a tangy lemony flavour, although more balanced and less tart than lemon juice.",
"capers":"unripened flower or green buds which are sun-dried and pickled.",
"harissa":"a hot sauce or paste used in North African cuisine, made from chilli peppers, paprika, and olive oil.",
"kadaif noodles":"Thin and short vermicelli-like noodles made from a mix of flour, sugar, walnuts and water, often used in Turkish desserts",
"baklava":"a dessert originating in the Middle East made of filo pastry filled with chopped nuts and soaked in honey.",
"Dark mole":"A traditional Mexican sauce which contains both the bitter-sweetness of chocolate and spiciness of peppers. ",
"Adobo":"A Mexican-styled sauce perfect for marinating meat in a flavorful mixture of vinegar, salt, garlic, paprika and oregano",
"amarillo mole":"A yellow Mexican sauce typically infused with herbs",
"acai":"a small, dark purple, berrylike fruit with a juicy pulp; often used in beverages or eaten raw; native to tropical rain forests of Central and South America.",
"Heart of palm":"the edible bud of a palm tree.",
"heart of palm":"the edible bud of a palm tree.",
"sauerkraut":"a German dish of chopped pickled cabbage.",
"mousse":"A sweet or savory French dish, usually cold, lightened with beaten egg whites or cream; from the French word for froth or foam.",
"Aleppo":"A dark red hot chili pepper variety used fresh, dried and powdered.",
"quail":"A small migratory white-meat game bird relished for its delicious flavor.",
"mole aioli":"Mexican sauce made up of spices, chiles and chocolate mixed with aioli to create a rich smokey and creamy taste",
"puris":"Crispy deep-fried Indian bread made from wholemeal flour",
"chana dal":"spilt chickpeas",
"tadka":"spices and herbs that are fried in oil to extract its essential flavours",
"shallots":"Shallots are favored for their mild onion flavor, and can be used in the same manner as onions. A shallot looks like a small, elongated onion with a copper, reddish, or gray skin. When peeled, shallots separate into into cloves like garlic.",
"scallion":"A young, undeveloped onion of no particular variety, with long green shoots; sometimes called spring onion or green onion.",
"brined":"A cooking process which involves submerging a cut of meat in a brine solution, which is simply salt dissolved in water.",
"rocket":"American term for rocket, a salad herb with peppery, piquant flavor, eaten raw or barely wilted",
"lentils":"lens-shaped seeds within flattened pods which is an edible grain legume",
"Sous-vide":"a french word which refers to the process of vacuum-sealing food in a bag, then cooking it at a precise temperature in a water bath.",
"tortillas":"thin, flat pancakes made from maize flour, eaten hot or cold, typically with a savoury filling.",
"baconaise":"bacon-flavor mayonnaise",
"brain octane oil":"A type of oil which offers nutritional benefits such as raises fat-burning and brain-fueling molecules in your body. ",
"reishi powder":"made from Reishi mushrooms which helps enhance the immune system, reduce stress, improve sleep and lessen fatigue.",
"chia":"the edible seed of a flowering plant. Chia seeds are packed with a high content of omega-3 fatty acids.",
"elderflower":"extracted from the European elderberry, it has a distinct musky and sweet scent and is used for its health benefits ",
"shiitake":"A Japanese mushroom with a flat round cap, dark brown with an earthy flavor, available both fresh and dried",
"relish":"a cooked and pickled sauce made from chopped vegetables, fruits or herbs and is typically used as a condiment.",
"salsa":"Italian and Spanish for sauce, general used in Mexican cooking. Salsa is made of tomatoes, onions, and chilies chopped and mixed together with water.",
"pepita":"Spanish for fruit seed; in Mexican cooking this means pumpkin seed.",
"Gochujang":"a savory and sweet korean condiment or red chili paste made from chili powder, glutinous rice, a variety of korean powder and salt.",
"alfalfa sprouts":"sprouts from a flower seed which is full of health benefits, low in calories and high in vitamins and minerals",
"pita":"sometimes spelled pitta (mainly UK), is a family of yeast-leavened round flatbreads baked from wheat flour, common in the Mediterranean, Middle East, and neighboring areas.",
"paprika":"A spice made from a variety of sweet red chili peppers, dried and powdered; widely used in Hungarian cooking; different types of paprika vary in heat, strength, and flavor.",
"couscous":"a type of pasta; tiny steamed balls of crushed Semolina (durum wheat), that can be used as a substitute for rice",
"sumec":"The dried and powdered fruits of Rhus which is used as a spice in Middle Eastern cuisine",
"halva":"is any various dense, sweet confections with roots in West Asia. It is generally a mixture of sugar syrup, egg whites and seasame seeds.",
"bamba":"made from peanut butter-flavored puffed maize. Bamba is enriched with several vitamins, and contains high amounts of fat and salt.",
"star anise":"literally, “eight points”; this chinese seed contains oil which helps improve digestion, alleviate cramps and reduce nausea.",
"ssamjang":"a thick, spicy Korean paste made of sesame oil, garlic, green onion, brown sugar and a variety of korean powder.",
"Pecorino":"hard italian cheese made from sheep's milk",
"nước mắm":"Vietnamese fish sauce",
"legumes":"are fruits or seeds of a plant called Fabaceae which contains a wide variety of nutrients",
"caul fat":"also known as lace fat or fat netting, typically used as a casing for sausages and other meat dishes.",
"crimson raisins":"dried crimson seedless grape",
"cos":"Romaine lettuce",
"paneer":"In Indian cooking, fresh milk curds, made from boiled milk curdled with lemon juice, that have been drained and compressed; used like fresh unripened cheese or tofu",
"fennel":"A vegetable, herb, and spice in many varieties whose bulb, stems, leaves, and seeds are edible",
"molasses":"A dark syrup remaining from sugarcane juice after sucrose crystallizastion, during the manufacture of sugar",
"fraiche":"A soured cream",
"pastrami":"Beef, usually shoulder, first pickled in spices and then smoked; of Romanian origin and now associated with Jewish cooking.",
"Sriracha":"A type of hot sauce or chili sauce made from a paste of chilli peppers.",
"rillete":"The preparation of meat similar to pâté. Slow cooked meat made into the form of a paste.",
"Kalamata olive":"Large black or brown olives with a smooth and meaty texture, named after the city of Kalamata in Greece.",
"kewpie mayo":"a smoother and creamer mayonnaise from Japan which is contains egg yolk instead of whole egg.",
"tortilla":"a thin, flat pancake mae from maize flour, eaten hot or cold, typically with a savoury filling.",
"corn husk":"outer protective shell of a corn",
"tamale":"a Mexican dish of corn dough (tamal) made with lard, filled with a savory stuffing, wrapped up in a piece of corn husk, and steamed.",
"ta krai sauce":"Thai sweet fish dipping sauce",
"Nam Prik Pao":"Thai chili paste commonly used in Thai cooking. It is spicy and sweet, with rich flavors of roasted vegetable and often enriched with shrimp.",
"croutons":"Pieces of sautéed or rebaked cubed bread that is used to add texture and flavour to dishes.",
"Beurre Noisette":"A type of warm French butter sauce used in savoury foods. It is notable for its deep yellow, almost brown colour and nutty scent.",
"Sage Butter":"Butter melted with sage leaves.",
"Balsamic":"A dark, concentrated and intensely flavoured vinegar made from grape must. ",
"Salsa Verde":"Cold and uncooked herbs made into a green sauce.",
"Baba Ghanoush":"A creamy Middle Eastern dip made of mashed eggplant mixed with tahini, olive oil, and various seasonings.",
"Pedro Ximinez ":"Pedro Ximénez is the name of a white Spanish wine grape",
"Chemoula":"A marinade and relish made from fresh herbs, garlic, lemon and warm spices. This sauce is traditionally used to flavour seafood, meats or vegetables.",
"kurma":"Type of Indian curry, consisting of meat or vegetables braised with yogurt or cream, water or stock, and spices to produce a thick sauce.",
"chowder":"A thick soup, made from various foodstuffs; chowder is usually made of seafood or perhaps vegetables, with a milk base.",
"croutes":"a slice of toasted or fried bread cut in fancy shape and used as a foundation in serving food.",
"sugo":"Italian for \"sauce\"",
"baguette":"A long cylindrical loaf of French white bread",
"kirsch":"a clear, colorless fruit brandy traditionally made from double distillation of dark-colored cherries.",
"chantilly":"Chantilly cream is a sweetened vanilla-flavoured whipped cream used for desserts and puddings.",
"anglaise":"ia light pouring custard used as a dessert cream or sauce.",
"escabeche":"Spanish and Portuguese for cooked fish served cold, sometimes poultry, marinated in vinegar or wine (which pickles it) and other seasonings.",
"quin":"Japanese horseradish; it comes fresh, powdered or as a paste, and is very hot in flavor and green in color.",
"lavosh":"a thin, Middle Eastern cracker bread that is commonly used to garnish salads or served as an appetizer and snack.",
"sage":"A herb with gray-green leaves, used since ancient times for medicinal and culinary purposes.",
"arrabiata":"is a spicy sauce for pasta made from garlic, tomatoes, and dried red chili peppers cooked in olive oil.",
"Nam Jim":"Thai for \"dipping/dressing sauce\"",
"tuile":"French for a crisp curvy cookie, sometimes made with crushed almonds.",
"creme legere":"a pastry cream with sweetened and flavoured whipped cream added.",
"Gianduja":"a sweet chocolate spread made with finely ground hazelnut smoothed into a paste",
"fatoush":"a Lebanese bread salad made from toasted or fried pieces of Arabic bread combined with mixed greens and other vegetables.",
"Roasted vermicelli":"extremely thin noodles that are roasted and often used in desserts.",
"Semolina":"a coarse, purified grind of high protein durum wheat or pasta wheat.",
"ghee":"Clarified butter; in India, ghee is usually made of buffalo butter. ",
"cardamom":"A spice of the ginger family whose pungent seeds are dried and crushed. It gives aroma and warmth to a range of dishes, savory and sweet, hot or cold.",
"Kilpatrick":"cooked osyters topped with cheese, bacon and Worcestershire sauce.",
"Arancini":"stuffed rice balls which are coated with bread crumbs and then deep fried.",
"Arrabbiata":"a spicy italian sauce made from garlic, tomatoes, and dried red chili peppers cooked in olive oil.",
"Endive":"leaf vegetable",
"San Daniele":"It is a tradition method of preparing Prosciutto that has been retain for centuries in the exact way. It is made with Italian pig meat, sea salt and the fresh San Daniele air.",
"Mortadella":"large Italian sausage or luncheon meat made of finely hashed or ground, heat-cured pork. It is flavoured with spices, including black pepper, myrtle berries, and pistachios.",
"Crostini":"an Italian appetizer consisting of small slices of grilled or toasted bread with toppings.",
"Pancetta":"Italian bacon made of pork belly meat that is salt cured and curled into a tight roll.",
"Cacciatore":"refers to a meal prepared \"hunter-style\" with onions, herbs, usually tomatoes, often bell peppers, and sometimes wine. ",
"Pangrattato":"Italian for bread crumbs",
"Guanciale":"Sea salt and black pepper cured pork cheek",
"Reggiano":"an Italian hard, granular cheese that is specifically made in Italian provinces.",
"Venison":"the meat of a deer",
"Risoni":"versatile pasta that are shaped like large grains of rice.",
"Gorgonzola":"An Italian blue cheese from whole cows’ milk. it has a rough reddish rind and creamy white interior streaked with blue; milder and less salty.",
"Bufala":"Italian for Buffalo Mozzarella cheese.",
"Savoiardi":"Ladyfingers or sponge fingers; low density, dry, egg-based sweet biscuits shapped like a large finger.",
"Marsala":"An Italian dessert wine. The wine is a deep amber color, usually dry but sometimes sweet.",
"tatin":"The tarte Tatin, is an upside-down pastry in which the fruits are caramelised in butter and sugar before the tart is baked.",
"sorbet":"frozen dessert made from sweetened water with flavouring of fruits.",
"riganato":"with the taste of oregano.",
"Ouzo":"a Greek dry anise-flavoured spirit.",
"berkshire":"Berkshire is one of the home counties in England.",
"phyllo":"Very thin sheets of dough, made from flour and water, layered, and filled with savory or sweet foods.",
"salata":"Salad",
"fritters":"A fried food usually consisting of a portion of batter or breading which has been filled with bits of meat, seafood, fruit or vegetables.",
"bisque":"A French smooth and creamy puréed soup, often made from shellfish, with the shells flambéed and pulverized for maximum flavor, then strained.",
"burrata":"Burrata is a fresh Italian cow milk cheese with a solid outer shell while the inside is soft and creamy.",
"cornichons":"French pickles made from small gherkins/cucumbers pickled in vinegar and tarragon.",
"halloumi":"A semi-hard, unripened, brined cheese made from a mixture of goat's and sheep's milk, and sometimes also cow's milk. It can be fried or grilled.",
"dill":"An herb whose leaves and seeds have a penetrating and aromatic scent, commonly used to flavour food.",
"kewpie":"a smoother and creamer mayonnaise from Japan which is contains egg yolk instead of whole egg.",
"labne":"yogurt that has been strained until it has the consistency of soft cheese, typically served with savoury seasonings as a dip or spread.",
"tangerine":"a small citrus fruit with a loose skin, especially one of a variety with deep orange-red skin (type of mandarin).",
"kefir":"fermented milk drink",
"sago":"A starch extracted from the stem of an Asian palm tree and used for thickening puddings and occasionally soups.",
"linseed":"dried seeds obtained from the flax plant (fiber crop).",
"Russet":"a dark brown color with a reddish-orange tinge",
"bagna cauda":"An Italian dipping sauce; made of garlic and anchovies in olive oil and butter or sometimes cream, served warm with raw vegetables on festive occasions. ",
"pilaf":"a rice or wheat dish, usually cooked in stock with added spices and meat.",
"latkes":"Fried potatoes in pancakes, traditionally eaten at the Jewish festival of Hanukkah.",
"horseradish":"A vegetable related to mustard, whose pungent root is grated and mixed with vinegar, then folded into a condiment or sauce; the tender young leaves can be used for salad.",
"chili verde":"A mexican stew of slow-cooked meat (traditionally prepared with beef or pork) flavored with hot green peppers.",
"provolone":"an Italian soft smoked cheese made from cow's milk and having a mellow flavour.",
"labna":"Strained yogurt in the Middle East; also spelled labneh; sometimes salted, spiced, shaped into balls, and rolled in olive oil; eaten with flatbread for breakfast.",
"lox":"Salmon, cured (but not smoked, as it used to be) with salt, then soaked in water to remove some of the salt.",
"Schmear":"refers to a spread",
"chard":"A sweet and nutritious plant with large green leaves and thick stems. ",
"panella":"unrefined whole cane sugar",
"challah":"Traditional Jewish Sabbath bread, made with yeast, oil, water, egg yolks, and honey, and baked in a braided loaf.",
"kim-chi":"a Korean dish of spicy pickled cabbage.",
"escargots":"a delicacy consisting of cooked edible land snails",
"risotto":"an Italian dish of rice cooked in stock with ingredients such as vegetables and meat or seafood.",
"moscato":"Italian for the MUSCAT grape. Moscato wine is fragrant and fruity, and Moscato d’Asti, from Piedmont, is low in alcohol, sweet, lightly sparkling, charmingly delicious; it is best drunk young.",
"hiramasa":"sushi made from the yellowtail amberjack (Seriola lalandi)",
"souffle":"a dish that is made from a sauce, egg yolks, beaten egg whites, and a flavoring or purée (as of seafood, fruit, or vegetables) and baked until puffed up.",
"provencale":"a fragrant tomato sauce made with sautéed onions, garlic, capers, olives, and Herbes de Provence.",
"calvados":"an apple or pear brandy from the Normandy region in France.",
"ratatouille":"a vegetable dish consisting of onions, courgettes, tomatoes, aubergines, and peppers, fried and stewed in oil and sometimes served cold.",
"fondant potatoes":"a method of preparing potatoes that traditionally involves cutting them into cylinders, browning the ends, and then slowly roasting them in butter and stock.",
"sauce chasseur":"a simple or compound brown sauce used in French cuisine. It is typically made using demi-glace or an espagnole sauce as a base, and often includes mushrooms and shallots.",
"beef bourguignon":"Beef Burgundy is a beef stew braised in red wine, often red Burgundy, and beef stock, generally flavoured with carrots, onions, and garlic.",
"gratin dauphinoise":"a French dish of sliced potatoes baked in milk or cream, from the Dauphiné region in south-east France.",
"Julienne ":"allumette, or french cut, is a culinary knife cut in which the food item is cut into long thin strips, similar to matchsticks.",
"beurre blanc":"a seasoned butter sauce (as for fish) flavored with white wine, shallots, and vinegar or lemon juice",
"rouille ":"a Provençal sauce made from pounded red chillies, garlic, breadcrumbs, and other ingredients blended with stock, typically added to bouillabaisse.",
"jus":"a thin gravy or sauce made from meat juices.",
"mar hor":"a popular Thai appetizer",
"soy sap":"soy sauce",
"prik pao":"Thai chilli paste",
"nam prik sap":"Another form of Thai chilli sauce",
"sichuan":"A spicy Chinese sauce with bold flavours derived from Sichuan pepper",
"Tonkatsu ":"a Japanese sweet and savoury sauce made from fruit and vegetables with soy sauce and other flavourings, served with breaded pork or other fried dishes.",
"Umami":"a category of taste in food (besides sweet, sour, salt, and bitter), corresponding to the flavour of glutamates, especially monosodium glutamate.",
"cacao":"seeds from a small tropical American evergreen tree, from which cocoa, cocoa butter, and chocolate are made.",
"cocoa":"a powder made from roasted and ground cacao seeds.",
"hummus":"a thick paste or spread made from ground chickpeas and sesame seeds, olive oil, lemon, and garlic, made originally in the Middle East.",
"kahawai":"New Zealand term for Australian salmon",
"tempura":"a Japanese dish of fish, shellfish, or vegetables, fried in batter.",
"tartare":"(of fish) served raw, typically seasoned and shaped into small cakes.",
"yakisoba":"a Japanese dish of fried noodles, vegetables, and meat, served with a thick, sweetish sauce.",
"nibs":"a piece of a cacao bean that has been roasted, dried, dehusked, and degermed —usually used in plural.",
"nib":"a piece of a cacao bean that has been roasted, dried, dehusked, and degermed —usually used in plural.",
"omelette":"French for omelet: eggs beaten and cooked in butter in a special flat pan until set, often filled or flavored with a wide variety of other ingredients.",
"Bulgogi":"thinly sliced beef or pork that is marinated in Korean sauce and cooked on fire. It has both a sweet and savoury taste.",
"kosho mayo":"A mix of Japanese Mayonnaise, Yuzu juice (yellowish citrus fruit used as flavouring), Yuzu-kosho and chives. \n\nYuzukoshō is a type of Japanese seasoning. It is a paste made from chili peppers, yuzu peel and salt, which is then allowed to ferment.",
"Aojiso":"Asian mint plant with large green or purple-red leaves, and oil-yielding seeds. The aromatic leaves of this plant is used as a condiment and flavouring. ",
"Mayoneza":"Mayonnaise",
"Fava Puree":"Fava beans puréed into a spread ",
"Oregano":"A mint plant",
"Rosewater":" A flavoured water made by steeping rose petals in water",
"dates":"dried fruits of date palm trees which contain high antioxidants and vitamins, providing several health benefits. ",
"papitas":"Spanish for potato chips",
"sautéed":"method of dry-heat cooking that uses a small amount of oil or fat in a shallow pan over relatively high heat to cook the food quickly.",
"zoodles":"Zucchini noodles",
"slaw":"Also known as cole slaw, is a salad consisting finely-shredded raw cabbage with a salad dressing, commonly either vinaigrette or mayonnaise.",
"labneh":"(in Middle Eastern cooking) yogurt that has been strained until it has the consistency of soft cheese, typically served with savoury seasonings as a dip or spread.",
"kefir":"a fermented milk drink with a sour taste, made using a culture of yeasts and bacteria.",
"kohlrabi":"a cabbage of a variety with an edible swollen stem.",
"papaya":"a tropical fruit shaped like an elongated melon, with edible orange flesh and small black seeds.",
"boukovo":"- chili flakes. Chili flakes are dried chillies that are then crushed leaving whole seeds and pieces of dried flesh.",
"riberry":"Syzygium luehmannii is a medium-sized coastal rainforest tree native to Australia. Common names include riberry, small leaved lilly pilly, cherry satinash, cherry alder, or clove lilli pilli.",
"duxelles":"a preparation of mushrooms sautéed with onions, shallots, garlic, and parsley and used to make stuffing or sauce.",
"chipotle":"or chilpotle, is a smoke-dried ripe jalapeño chili pepper used for seasoning.",
"Monterey Jack":"Monterey Jack, sometimes shortened to Jack, is an American semi-hard cheese, customarily white, made using cow's milk.",
"chipotlé":"a smoked hot chilli pepper used in Mexican cooking.",
"heirloom":"An heirloom is generally considered to be a variety that has been passed down, through several generations of a family because of it's valued characteristics.",
"shaoxing wine":"Traditional Chinese wine, fermented from rice. It is widely used as both a beverage and a cooking wine.",
"tokpokki":"Traditional Korean dish with stir-fried rice cakes in red chilli pepper paste.",
"v-mint":"Vietnamese coriander",
"hoisin":"Hoisin sauce is a thick, fragrant sauce commonly used as a glaze for meat or as dipping sauce. It is darkly colored in appearance and sweet and salty in taste.",
"Pipis":"Small, edible saltwater clam ",
"granita":"Italian fruit ice or semi-frozen dessert made from sugar, water and various flavorings.",
"soba":"Japanese for buckwheat",
"Mizuna":"Mild flavored Japanese mustard greens",
"monterey jack cheese":"an American semi-hard cheese, customarily white, made using cow's milk",
"vegemite":"a thick, black Australian food spread made from yeast extract with various vegetable and spice additives",
"cornbread":"any quick bread containing cornmeal",
"Angus Beef":"a Scottish breed of small beef cattle",
"Swiss Cheese":"cheese from Switzerland, typically containing large holes",
"Golf Sauce":"a cold sauce of somewhat thick consistency",
"Pulled Pork":"an American culinary dish which uses shredded barbecued pork shoulder as the main ingredient",
"tomatillo":"also known as the Mexican husk tomato, is a plant of the nightshade family bearing small, spherical and green or green-purple fruit of the same name.",
"sambal":"(in oriental cooking) hot relish made with vegetables or fruit and spices.",
"masala":" a mixture of ground spices used in Indian cooking.",
"quinoa":"a type of seed that is used as a rice base and is gluten-free, high in protein and high in fibre. Sometimes used as a substitute for rice.",
"Taleggio":"A raw whole cows’ milk cheese, with a delicate, buttery and velvety texture. It is white and dense in the middle.",
"Black truffle":"A type of black fungi, found in tree roots. It has a garlicky, musky type flavour.",
"Scamorza":"A whole-milk cows’ cheese that is similar to mozzarella, and sometimes is smoked.",
"Caponata":"A Sicilian eggplant dish consisting of a cooked vegetable salad made from chopped fried eggplant and celery seasoned with sweetened vinegar, with capers in a sweet and sour sauce.",
"Artichoke":"A vegetable that looks like a large flower bud with thick outer leaves.",
"Caperberries":"Berries from the caper plant.",
"Salsa verde":"A type of green sauce made from herbs and sometimes green tomatoes.",
"Grana Padano":"A hard, slow-ripened, semi-fat, cow's-milk cheese from Italy.",
"Sage":"A herb that is part of the mint family.",
"buffalo mozzarella":"Buffalo mozzarella is a type of mozzarella cheese made from the milk of Italian Mediterranean buffalo.",
"Prosciutto":"An Italian dry-cured, smoked ham that is sliced thinly and served cold.",
"Roma tomato":"A plum tomato popularly used both for canning and producing tomato paste because of their slender and firm nature. ",
"Stracciatella":"An Italian soup made from eggs and cheese.",
"pesto":"A green Italian sauce made from crushed garlic, pine nuts, salt, basil leaves, and hard cheese such, all blended with olive oil.",
"Wagyu Bresaola":"A lean and tender meat made from Australia Wagyu beef. The meat is cured and dried in a range of earthy spices with a heated kick on the finish, tender and richly marbled.",
"pomodoro sauce":"Italian for tomato sauce",
"marscapone":"An Italian full cream cheese made with the addition of an acidic substance, such as lemon juice, vinegar or citric acid",
"speck":"A roasted, spiced cured ham",
"rocquette":"Italian for rocket lettuce",
"funghi porcini":"A type of mushroom",
"wok tossed":"Food tossed and cooked in a Chinese bowl-shaped frying pan",
"toffee":"A candy made from sugar or molasses cooked down, usually with butter, nuts, and other flavorings. American taffy, especially saltwater taffy, tends to be soft and chewy, while British toffee is brittle.",
"agria":"Agria potatoes",
"shitake":"An edible mushroom native to East Asia, which is cultivated and consumed in many Asian countries.",
"currants":"Also called Zante currants, are dried berries of the small, sweet and seedless grapes",
"tzatziki":"a dip made of yogurt mixed with cucumbers, garlic, salt, olive oil, sometimes with vinegar or lemon juice, and herbs.",
"origano":"A type of mint",
"wasabi":"Often called Japanese horseradish. It comes fresh, powdered, and as a paste, and is very hot in flavor and green in colour.",
"garbanzos":"commonly known as chickpeas",
"Togarashi":"A Japanese spice/condiment made of capsicum or chilli pepper",
" jahl muri":"Jhalmuri is an Indian street snack made of puffed rice and an assortment of spices and vegetables",
"enoki":"long, thin white Japanese mushrooms",
"tapenade":"A name for a dish consisting of puréed or finely-chopped olives, capers, and olive oil.",
"Kabayaki sauce":"A thick, sweet-and-salty sauce made with soy sauce, sugar and mirin.",
"Panzanella":"a Tuscan chopped salad of bread and tomatoes",
"watermelon":"A large melon, with green skin and red flesh, 92 percent water, an oasis on a hot summer day; it belongs to a different genus than the cantaloupe, a distant relative. The watermelon, native to Africa, came to the United States with the slave trade; it likes a hot, dry climate and sandy soil. The melon’s shape can be small and round or large and oval, weighing anywhere from 5 to 40 pounds or many times more for giants; small ones may be handy, but the larger have a higher proportion of edible flesh. Varieties other than the familiar red have white or yellow flesh; new “seedless” varieties have barely noticeable seeds.",
"ricotta":"a soft white unsalted Italian cheese.",
"salsa fresca":"or salsa cruda, is made from chopped tomato, onion, cilantro, serrano peppers (jalapeños or habaneros are used as alternatives), salt, and lime juice.",
"tomatilla":"an edible purple or yellow fruit which is chiefly used for sauces and preserves.",
"lime crema":"A sauce created by stirring sour cream, lime juice, and cilantro. Season with salt and pepper.",
"picante queso":"This spicy cheese dip is a flavorful seasoned combination of two kinds of cheese and salsa or Picante sauce. ",
"chamoy":"Chamoy is a variety of savory sauces and condiments in Mexican cuisine made from pickled fruit.",
"tequila crema":"Crema de Tequila is a unique, handcrafted product that combines the soft taste of cream with authentic, high quality tequila. This interesting blend boasts enticing aromas of agave, earth and fresh herbs which lead to a sweet, creamy palate with hints of coffee, cocoa and caramel.",
"mole":"is a traditional sauce originally used in Mexican cuisine, as well as for dishes based on these sauces. Outside Mexico, it often refers specifically to mole poblano.",
"rioja":"a wine produced in La Rioja, Spain.",
" Eshallot ":"Garlic",
"Lemon mytle":"Lemon Myrtle is a plant grown on the east coast of Australia",
"Veal":"the meat of calves",
"chorizito ":"A spicy sausage used in Spanish and Latin cooking, made of pork meat and fat and flavored with garlic and spices",
"grissini":"Breadsticks",
"nduja":"Nduja is a crostini paste from Calabria, made with pork and chilli. ",
"macadamia":"Macadamias are a commercial crop in Hawaii, but they originated in northeastern Australia",
"tomato passata":"Tomato purée, The difference between tomato paste, tomato purée, and tomato sauce is consistency",
"show pea tendrils":"also known as pea shoots, are the young leaves, stems, vines, and flowers of a pea plant.",
"flaxseed":"the small seed of flax",
"nudja ":"'Nduja is a particularly spicy, spreadable pork salumi from Italy",
"wattle seed":"edible seeds which are either eaten green or dried to make a type of bush bread",
"paris mash":"mashed potato\n",
"bernaise":"s a sauce made of clarified butter emulsified in egg yolks and white wine vinegar and flavored with herbs",
"tarragon":"also known as estragon, is a species of perennial herb in the sunflower family.",
"spiced strusel":"a crumbly mixture of fat, sugar, and flour and sometimes nuts and spices that is used as topping or filling for cake.",
"pico de gallo ":"also called salsa fresca or salsa cruda, is made from chopped tomato, onion, cilantro, serrano peppers, salt, and lime juice. ",
"Mcclures":"A brand of pickles\n",
"hemp":"A source of great protein; the seeds of an Asian plant which are rich in healthy fats and essential fatty acids. ",
"jackfruit":"the starchy bland fruit is similar to pineapple in its complex formation, with yellow flesh and edible seeds; eaten unripe as a vegetable",
"tempeh":"An Indonesian staple of fermented soybeans that are pressed into firm blocks, suitable for stir-frying or grilling.",
"Monterrey Jack":"Monterey Jack, sometimes shortened to Jack, is an American semi-hard cheese, customarily white, made using cow's milk.",
"brisket":"A cut of beef from the lower forequarter, between the foreshank and short plate; usually braised or cured for CORNED BEEF.",
"slaw":"A sliced cabbage salad",
"jalapeno":"A medium-sized chilli pepper with Scoville units between 3,500 to 8,000",
"ranch":"A type of salad dressing made from buttermilk, salt, garlic, onion, mustard, herbs, and spices or mayonnaise",
"aioli":"A sauce made from garlic and olive oil",
"asiago cheese":"A cow's milk cheese from Northern Italy that has a nutty and creamy flavour",
"sopressa salami":"Italian aged salami, made with pork, lard, salt, pepper, spices and garlic",
"red bean chilli":"A spicy stew containing chili peppers, meat (usually beef), and often tomatoes and beans",
"curry leaves":"The curry tree is a tropical to sub-tropical tree in the family Rutaceae, which is native to India. Its leaves are used in many dishes in Indian subcontinent.",
"Madeira":"Madeira officially the Autonomous Region of Madeira (Região Autónoma da Madeira), is one of the two autonomous regions of Portugal (along with the Azores).",
"San Marzano":" is the name associated with Italian plum tomatoes of legendary quality — sweet and flavorful — and sold as far away as Japan",
" straciatella":"an Italian soup containing eggs and cheese.",
"nougat":"A candy of roasted nuts (usually almonds or walnuts) with honey or syrup; there are many varieties.",
"Savoidardi biscuits":"Dry, egg-based, sweet sponge finger-shaped biscuits",
"Frangelico":"Herb-flavoured liqueur coloured with caramel colouring",
"espresso":"Strong Italian coffee made with a special machine that forces steam through the coffee grounds",
"Cerignola olives":"An olive from Italy. Cerignola olives are very large, mild in flavor, and may be served either green or cured red or black.",
"casalinga bread":"A type of everyday Italian household bread that is typically made with a starter dough, which is often prepared with milk and malt extract.",
"rapa":"A white turnip",
"arborio rice":"Italian short grain rice",
"bocconcini":"Small mozzarella cheeses the size of an egg. It is a semi-soft, white and rindless unripened mild cheese",
"prosciutto crudo":"Italian dry-cured ham that is usually thinly sliced and served uncooked",
"chocolate cremeu":"Chocolate crémeux is a smooth, dense pastry cream. You could compare it to a velvet-like creamy custard with a rich, deep and intense chocolate flavour.",
"pashmak":"Pashmak is a form of Persian candy floss or cotton candy, made from sesame and sugar. ",
"hominy":"Corn kernels with the bran and germ removed either by a lye bath, as for whole kernels in lye hominy, or by crushing and sifting, as for pearl hominy; hominy grits, a southern U.S. favorite, are often served as porridge for breakfast or as starch for dinner seasoned with cheese; the word hominy is American Indian in origin.",
"orange curd":"A dessert spread and topping made from oranges",
"pinto beans":"A medium-sized speckled variety of kidney bean",
"salsa rioja":"A tomato based sauce made with Rioja wine",
"cactus mole":"A traditional sauce used in Mexican cuisine, made with the cactus plant",
"cumin":"A pungent spice made from the dried and ground seeds of the cumin plant; a relative of parsley, cumin is used in Mexican, North African, Middle Eastern, and Asian cooking",
"kale":"A loose, green leafy vegetable with a stronger taste than its cabbage cousin. It has numerous vitamins and minerals",
"chipotle mayonnaise":"A type of mayonnaise made with a smoked hot chilli pepper",
"rye":"A grain native to central Asia and is often used for bread, as it does not form gluten well.",
"anchovy":"A small silvery fish, sometimes broiled or fried fresh.",
"parmesan":"A hard, granular Italian cheese.",
"verde":"When used with the verb ser, verde means literally green in colour",
"jalapeño":"a hot green or orange-red pepper, the fruit of a variety of Capsicum annuum, used especially in Mexican cooking",
"jalapeños":"a hot green or orange-red pepper, the fruit of a variety of Capsicum annuum, used especially in Mexican cooking",
"Eshallot":"Another type of onion which grows from a bulb rather than seed.",
"Pepperberry":"berries with leaves and stems which produces an aromatic peppery taste and is commonly used in sweet and savoury dishes.",
"lonza":"Italian word for cured loin of pork.",
"andouille sausage":"Smoked french sausage made using pork roast. ",
" chervil":"French parsley or garden chervil, is a delicate parsley herb. It is commonly used to season mild-flavoured dishes.",
"striploin":"The strip steak is a tender cut of beef steaks from the short loin. ",
"Café de Paris":"Café de Paris sauce is a complex butter-based sauce served with grilled beef. ",
"samphire":"A coastal species with white flowers and is commonly eaten fresh in salads, cooked as a vegetable or pickled.",
"lemon myrtle":"A Tasmanian bush spice, found growing in the Rainforest. It has the tartness of lemon and the herby flavour of basil.",
"Mignonette":"Mignonette sauce is a condiment usually made with minced shallots, cracked pepper, and vinegar.",
"di casa":"House-made",
"fontina":"an Italian cow's milk cheese",
"agrodolce":"traditional sweet and sour sauce in Chinese cuisine",
"porchetta":"Italian for roast suckling pig",
"artichokes":"A vegetable that looks like a large flower bud with thick outer leaves.",
"Bearnaise":"A sauce made of clarified butter emulsified in egg yolks and white wine vinegar and flavored with herbs",
"acqua pazza":"Used in Italian cuisine to refer to a recipe for poached white fish, or the lightly herbed broth used to poach it.",
"amaretti":"Small, crunchy, chewy-inside, Italian macaroon-like cookies made with almond flour, egg whites, and sugar.",
"grand marnier":"A French brand of orange-flavored liqueur",
"Japchae":"A sweet and savory dish of stir-fried glass noodles and vegetables that is popular in Korean cuisine.",
"oyster sauce":"A sauce used in Chinese cooking, consisting of oysters, salt, and seasonings concentrated into a thick paste. ",
"teriyaki sauce":"An Asian marinade consisting of: soy sauce, sake (or mirin), sugar and ginger. ",
"udon":"Japanese wheat noodle.",
"sashimi":"Means “fresh slice,” in Japanese this really means raw fish expertly sliced according to the particular variety and served with garnishes, condiments, and sauces.",
"perilla seeds":"A staple food in many Asian cultures. It’s also known as shisho or beefsteak (the leaf) and the seed contains a higher concentration of fatty acids.",
"bulgogi":"Korean barbecue of marinated beef, or, less commonly, chicken or squid, cooked over a wood fire or, more recently, a gas grill.",
"jjolmyeon noodles":"A type of Korean noodles that have a very chewy texture and are made from wheat flour and starch.",
"kimmari":"Korean deep fried seaweed spring rolls",
"Korean ginseng":"A root from Eastern Asia and used in folk medicine. It is believed to have health benefits such as helping strengthen the immune system and fight off stress and disease.",
"chestnut":"A type of brown nut, usually boiled or steamed. It is a good source of vitamin C as well as vitamins B1, B2, and B6 and folic acid. ",
"glutinous rice":"Sweet or sticky rice with a high starch content and opaque creamy color, easy to eat with chopsticks; in both long- and short-grain varieties.",
"date":"A small red fruit from the date palm tree, high in antioxidants and fibre.",
"leek":"A vegetable with long stalks and stems.",
"stone fruits":"are fruits with a seed or pit. Examples are peaches, nectarines, plums, lychees, mangoes and cherries.",
"kassler":"Greman for salted and slightly smoked cut of pork",
"brie":"A soft french cow's-milk cheese. It is pale in color with a slight grayish tinge under a rind of white mould.",
"Geojackjang":"",
"Kailan":"a long, blue-green vegetable with thick, glossy stems and leaves typically eaten in Chinese and particularly Cantonese cooking",
"Kipfler Potatoes":" small to medium in sized potatoes, and are long, narrow, and have a cigar, finger-like shape",
"Buttermilk":"the slightly sour liquid left after butter has been churned, used in baking or consumed as a drink",
"sourdough":"leaven, especially fermented dough retained from one baking and used, rather than fresh yeas",
"persian feta":"a lush buttery finish cheese with a salty tang that is made from cow's milk, marinated in garlic, bay leaves, peppercorns, fresh thyme and olive oil",
"chives":"a small Eurasian plant related to the onion, with purple-pink flowers and long tubular leaves which are used as a culinary herb",
"ponzu":"a citrus-based sauce used in Japanese cuisine as a marinade or an addition to soy sauce",
"panko":"breadcrumbs with a light, flaky texture, typically used as a coating for fried or baked food in Japanese cooking.",
"nahm jim":"Thai for \"dipping sauce\" and refers to a wide variety of dipping sauces in Thai cuisine, with many of them a combination of salty, sweet, spicy and sour.",
"betel leaf":"A vine belonging to the Piperaceae family, which includes pepper and kavaIt and may also be used in cooking, usually raw, for its peppery taste.",
"tom yum":"Tom yum or tom yam is a type of hot and sour Thai soup, usually cooked with shrimp.",
"Ora King salmon":"Type of salmon raised by the King Salmon Company, named after the New Zealand Maori word for \"fresh\" and \"alive\".",
"pea eggplant":"A type of eggplant that look like green peas clustered together like grapes with short stems. ",
"Thai curry":"Refers both to dishes in Thai cuisine that are made with various types of curry paste and to the pastes themselves.",
"pork hock":"The portion of the leg that is neither part of the ham proper nor the ankle or foot, but rather the extreme shank end of the leg bone. Somewhere from the knee to the ankle.",
"Thai basil":"A herb native to Southeast Asia, with anise- and licorice-like and slightly spicy flavours.",
"hapuka":"A wreckfish of the family Polyprionidae, found around southern Australia, southern South America, South Africa and New Zealand",
"green papaya":"A fruit with juicy, sweetish and somewhat like a cantaloupe in flavor, although musky in some types.",
"morning glory":"A semi-aquatic, tropical plant grown as a vegetable for its tender shoots and leaves. Also known as water spinach.",
"starfruit":"A fruit from the Philippines, Indonesia and Malaysia. When cut, it resembles the shape of a star.",
"watercress":"A plant growing in shallow streams, whose crisp, deep green leaves are used fresh as an herb, salad green, and garnish, also cooked in soups, sauces, and savory dishes; a member of the mustard family, its flavor is lightly peppery.",
"snake beans":"A legume cultivated for its edible green pods containing immature seeds, similar to the green bean.",
"mustard greens":"The leaves of the mustard plant used in cooking. Also known as collard greens.",
"pomelo":"A large yellow fruit that looks like a grapefruit. Tastes like a grapefruit but less bitter.",
"shucked":"Removing the outer shell or husk from shellfish.",
"Chinese broccoli":"A leafy vegetable that has thick, smooth stems, waxy bluish-green leaves, also known as kai lan.",
"galangal":"An Asian plant of the ginger family, the aromatic rhizome of which is widely used in cooking and herbal medicine.",
"Bannockburn":"A brand of free range chickens from Victoria, Australia.",
"green peppercorns":"Under-ripe peppercorn berries and have a mild peppery flavor and are used for pepper steak, or sauces and with vegetables.",
"Bibimbab":"a Korean rice dish, served as a bowl of warm white rice topped with mixed vegetable, optional meat, soy sauce and spicy Korean paste.",
"glass noodles":"Cellophane noodle, sometimes nicknamed as glass noodles, are a type of transparent noodle made from starch and water.",
"Fish cake":"a patty of shredded fish",
"tteok bok ki":"a spicy stir-fried rice cake dish is a highly popular Korean street food and a delicious comfort food",
"alfalfa":"a leguminous plant with clover-like leaves and bluish flowers, native to south-western Asia and widely grown for fodder.",
"tataki":"(in Japanese cooking) a dish consisting of meat or fish steak, served either raw or lightly seared.",
"spelt grain":"also known as dinkel wheat or hulled wheat",
"emulsion":"A stable liquid mixture in which one liquid is suspended in tiny globules throughout another, as with egg yolks in oil or butter for mayonnaise or hollandaise sauce.",
"kombu dashi":"Japanese stock made from kelp and is used as the basic flavouring.",
"mirin":"Japanese rice wine, syrupy and sweet, used for cooking.",
"hoi sin sauce":"thick, fragrant sauce commonly used in Chinese cuisine as a glaze for meat, or as dipping sauce. It is darkly colored in appearance and sweet and salty in taste.",
"Shao Xing wine":"Chinese cooking rice wine",
"XO sauce":"a spicy seafood sauce",
"dahl":"Indian lentils stew",
"Takoyaki sauce":"sweet sauce that goes on top of ball-shaped Japanese snack made of a wheat flour-based batter. Takoyaki is typically filled with minced or diced octopus, tempura scraps, pickled ginger, and green onion.",
"Cheese fondu":"a preparation of melted cheese (such as Swiss cheese and Gruyère) usually flavored with white wine and kirsch",
"pistachio":"the edible pale green seed of an Asian tree",
"panagrattato":"breadcrumbs",
"pecan":"a smooth pinkish-brown nut with an edible kernel similar to a walnut.",
"dukka":"Egyptian condiment consisting of a mixture of herbs, nuts, and spices",
"kombu":"Kombu is edible kelp from mostly the family Laminariaceae and is widely eaten in East Asia",
"Yakiniku ":"(焼き肉 or 焼肉), meaning \"grilled meat\", is a Japanese term that, in its broadest sense, refers to grilled meat cuisine.",
"Furikake":" (振り掛け / ふりかけ) is a dry Japanese seasoning meant to be sprinkled on top of cooked rice, vegetables, and fish. It typically consists of a mixture of dried fish, sesame seeds, chopped seaweed, sugar, salt, and monosodium glutamate.",
"petit four":"A petit four (plural: petits fours, also known as mignardises) is a small bite-sized confectionery or savoury appetizer. The name is French, petit four (French pronunciation: ​[pə.ti.fur]), meaning \"small oven\".",
"scampi":"Norway lobsters when prepared or cooked.",
"lemon balm":"this leafy, green herb has a lemony flavour and fragrance. It works well with fish, poultry and vegetables as well as in salads, stuffings and drinks.",
"gouda cheese":"is a mild, yellow cheese, originating from the Netherlands, made from cow's milk.",
"mascarpone":"a soft, mild Italian cream cheese.",
"trout":"The rainbow trout is a trout and species of salmonid native to cold-water tributaries of the Pacific Ocean in Asia and North ",
"chulpi":"It's a sort of popcorn made from a special variety of corn called maiz chulpe",
"ciabatta":"an Italian white bread made from wheat flour, water, olive oil, salt, and yeast",
"mezcal":"is a distilled alcoholic beverage made from any type of agave. The word mezcal comes from Nahuatl mexcalli [meʃˈkalːi] metl [met͡ɬ] and ixcalli [iʃˈkalːi] which means \"oven-cooked agave\".",
"agave":"a succulent plant with rosettes of narrow spiny leaves and tall flower spikes, native to the southern US and tropical America.",
"cayenne pepper":"is a type of Capsicum annuum. It is usually a moderately hot chili pepper used to flavor dishes. ",
"micro greens":"Microgreens are a vegetable green, harvested after the Cotyledon leaves have developed, not to be confused with sprouts or shoots, that are used both as a visual and flavor component or ingredient primarily in fine dining restaurants",
"bechamel":"also known as white sauce, is made from a white roux and milk",
"shrimp floss":"a classic Malaysian condiment, Dried Shrimp Floss",
"zhejiang":"an eastern coastal province of China",
"vermicelli":"Very thin pasta—literally “little worms” in Italian—often used for soups and puddings.",
"char sui":"a popular way to flavor and prepare barbecued pork in Cantonese cuisine.",
"hickory salt":"aromatic salt smoked with any number of select bark free woods for up to 14 days",
"maize":" a member of the grass family Poaceae. It is a cereal grain which was first grown by people in ancient Central America",
"pilau":"a Middle Eastern or Indian dish of rice cooked in stock with spices, typically having added meat or vegetables.",
"achar":"South Asian pickles",
"kung pao":"is a spicy, stir-fried Chinese dish usually made with chicken, peanuts, vegetables, and chili peppers",
"sous vide":"Sous-vide is a method of cooking in which food is placed in a plastic pouch or a glass jar and cooked in a water bath for longer than normal cooking times at an accurately regulated temperature",
"worchester":"Worcestershire sauce is a fermented liquid condiment created in the city of Worcester ",
"kizami":"A shredded form of nori used in Japanese dishes.",
"kingfish":"any of a number of large sporting fish, many of which are edible.",
"takikomi gohan":"is a Japanese rice dish seasoned with dashi and soy sauce along with mushrooms, vegetables, meat, or fish. ",
"katsu":"or “cutlet” in Japanese, refers to meat that's been pounded thin before being cooked. ... Chicken katsu is a popular dish of fried chicken wherein the meat is seasoned, then dredged in flour, then egg, and finally panko breadcrumbs—a flaky type of breadcrumb made with white bread.",
"karaage":"is a Japanese cooking technique in which various foods—most often chicken, but also other meat and fish—are deep fried in oil.",
"kara age":"is a Japanese cooking technique in which various foods—most often chicken, but also other meat and fish—are deep fried in oil.",
"chashu":"The origin of chashu came from Chinese barbecued pork called Char Siu (叉燒). ... On the other hand, Japanese chashu served with bowls of ramen are actually braised in soy sauce, sake and sugar at low temperature.",
"tabasco":"A chilli sauce made from the fruit of a capsicum pepper",
"raita":"an Indian side dish of yogurt containing chopped cucumber or other vegetables, and spices",
"pangritata":"A mixture of breadcrumbs and fresh herbs lightly toasted in olive oil, pangritata (or ‘poor man’s Parmesan) is the ingenious invention of southern Italians eager to add flavor and texture to pasta without the added expense of fine cheeses and other ingredients.",
"kaiserfleisch":"is a Ham made only from the eye of the pork loin. ",
"Mekhong":" Thailand's first domestically produced branded golden spirit (alcohol)",
"namjim":"Thai style dipping sauce",
"Larb":"a type of Lao meat salad",
"pandan":"pandan leaves are used to lend a unique taste and aroma to some savory dishes, but mainly it is used to flavor desserts and some drinks",
"evoo":"An acronym for Extra Virgin Olive Oil",
"evo":"An acronym for Extra Virgin Olive Oil",
"lemongrass":"A type of grass with long, tapered, fibrous leaves and small tender white bulb; much used in the cooking of Southeast Asia, where lemons do not grow, to impart its subtle but distinct flavor to curries, soups, and other dishes. Lemongrass (sometimes spelled as two words) can flavor indirectly, like bay leaf, when the stalk is removed before eating the dish, or more pungently, when the thicker bulb is finely chopped or ground to a paste before being added to stirfries, braises, and raw dishes. For storage, lemongrass can be frozen or dried. The Thai word is takrai, the Indonesian sereh.",
"yam bean":"a Central American climbing plant of the pea family, which has been cultivated for its edible tubers (jicama) since pre-Columbian times",
"shallot":"a small bulb which resembles an onion and is used for pickling or as a substitute for onion",
"cinnamon":"an aromatic spice made from the peeled, dried, and rolled bark of a SE Asian tree",
"clove":"the dried flower bud of a tropical tree, used as an aromatic spice",
"activated charcoal":"charcoal that has been heated or otherwise treated to increase its adsorptive power",
"bamboo shoot":"a young shoot of bamboo, eaten as a vegetable",
"lemon curd":"a thick conserve made from lemons, butter, eggs, and sugar",
"mojo de ajo":"garlic gravy; often paired with pasta or seafood items",
"tostada":"Spanish for toast; in Mexico this means a tortilla fried flat and then topped with all kinds of garnishes, sometimes stacked high.",
"guajillo":"A long, thin, dried chili pepper, reddish brown and smooth, very hot",
"masa":"In Mexican cooking, a dough of dried cornmeal and water, used in making tortillas and other preparations",
"frijoles":"Spanish for beans",
"cotija cheese":"a cow's milk hard cheese that originated in Mexico",
"salsa macha":"a very thick and unusual salsa made by frying dried chipotle chiles in a generous amount of olive oil, along with garlic cloves",
"salsa verde":"a Mexican sauce of finely chopped onion, garlic, coriander, parsley, and hot peppers",
"esquites":"a Mexican snack; generally made from mature corn, not fresh or dried",
"amaranth":"nutritious, high-protein seeds, eaten as cereal and ground into flour, and leaves, eaten fresh or cooked",
"pasilla":"the dried form of the chilaca chili pepper",
"Herradura anejo":"a brand of Tequilla - 40%",
"granola":"a breakfast food and snack food consisting of rolled oats, nuts, honey or other sweeteners, that is usually baked until it is crisp, toasted and golden brown. ",
"challah bread":"a special bread in Jewish cuisine, usually braided and typically eaten on ceremonial occasions such as Sabbath and major Jewish holidays.",
"candied":"process of preserving food by coating it in sugar syrup.",
"goat's chevre":"another name for goat's cheese.",
"chipolatas":"a type of fresh sausage, likely created in France; often prepared as a relatively thin and short sausage.",
"barley":"a type of cereal grain that is high in fibre.",
"silverbeet":"a leafy green vegetable with silvery stalks, also known as Swiss chard.",
"Preserves":"foodstuff made with fruit preserved in sugar, such as jam or marmalade",
"Pistachios":"the edible pale green seed of an Asian tree",
" Hash Brown":"chopped cooked potatoes, typically with onions added, fried until brown",
"feta":"white salty Greek cheese made from the milk of ewes or goats",
"chorizo":"is a type of pork sausage. Traditionally, it uses natural casings made from intestines, a method used since Roman times.",
"Kung-Fu Sauce":"Home Made Tomato Relish with Sweet and Sour taste",
"Korean Mayo":"Korean chili pepper paste with Mayonnaise",
"Thai Chili Mayo":"Sweet chili with an anchovy touch",
"Peking duck sauce":"plummy taste brown sauce, blend of sweet and savory",
"cotija":"is a cow's milk hard cheese that originated in Mexico. It is named after the town of Cotija, Michoacán.",
"elote":"Elote corn is Mexican street corn roasted over an open grill and coated with salt, chile powder, butter, cotija, lime juice, and mayonnaise or crema fresca.",
"saltbush":"a salt-tolerant orache plant sometimes used in the reclamation of saline soils or to provide grazing in areas of salty soil.",
"habanero":"The habanero is a hot variety of chili pepper. Unripe habaneros are green, and they color as they mature. ",
"Acapulco coctel":"is made with orange fanta, tabasco, tomato sauce, lime and pepper.",
"poblano":"a large dark green chilli pepper of a mild-flavoured variety.",
"mojo":" is the name, or abbreviated name, of several types of sauces, varying in spiciness, consisting primarily of olive oil, local pepper varieties, garlic, paprika, cumin or coriander, and other spices. ",
"chile de agua ":"are peppers that are most often harvested when still green, before the spice level increases, or when the color is a slight orange or a moderate red. ",
"Chiles toreados":"are a dish that you'll commonly find in taquerías in Mexico. They're usually made with serrano or jalapeño chiles that are sautéed in oil until the chiles are blistered. ",
"arbol":"a small, elongate hot pepper of Mexico that is bright red when mature Chile de arbol, a relative of the cayenne pepper, it has an acidic, smoky heat that gives it a killer punch",
"paratha":"a flatbread that originated in the Indian subcontinent",
"pipi":"Paphies australis or pipi is a bivalve mollusc of the family Mesodesmatidae, endemic to New Zealand. The pipi is a shellfish with a solid white, elongated symmetrical shell with the apex at the middle.",
"beanshoots":"also known as bean sprout",
"kaffir lime":"a citrus tree of SE Asia with green fruit and aromatic leaves that are used in Thai and Indonesian cooking",
" Jasmine":"popular as an ornamental and bears fragrant white, pink, or yellow flowers.",
"snapper":"a type of fresh water fish, the most common is red snapper",
"bao":"Chinese for 'bun'",
"dashi":"Japanese fish stock made of dried bonito and seaweed; used extensively in Japanese cooking",
"lup cheong":"a type of dried, hard Chinese sausage usually made from pork and a high content of fat. It is normally smoked, sweetened, and seasoned with rose water, rice wine and soy sauce",
"sate":"another word for satay, which is a type of skewered, seasoned and grilled meat",
"pun cha vinegar":"a brand of vinegar",
"coriander":"A herb of the parsley family whose leaves, seeds, and roots are much used in the cooking of the Mediterranean and Far East, Asia (but not Japan), India, the Caribbean, and Mexico",
"wonton":"Chinese for wonton: a pastalike egg dough wrapper",
"Chonburi":"a province in Thailand",
"snowpeas":"a variety of peas that is eaten with its pod",
"Crying tiger beef":"a traditional Thai recipe of marinated beef slices served over a bed of salad and sprinkled with toasted rice powder",
"barramundi":"a freshwater and saltwater fish native to northern Australia",
"longbean":"a long type of bean that is eaten with its pod, also known as a snake bean",
"wood ear mushrooms":"a type of mushroom fungus that is thin, gray-brown to black color and has a rubbery texture",
"apple eggplant":"also known as a Thai eggplant; short, small and plump type of eggplant",
"holy basil":"a herb native to Southeast Asia; known to have various health benefits",
"guava":"a tropical fruit that is round or pear shaped, with white or maroon flesh, depending on its type, and has small hard seeds enveloped in its soft, sweet pulp",
"kalamansi":"a type of citrus fruit native to Southeast Asia, similar to an orange or kumquat",
"cremoso":"a fresh cheese elaborated with cow's milk, with or without the addition of cream and originated from Argentina",
"ka-prao":"meat such as pork, chicken, beef, and seafood stir fried with Thai basil and garlic.",
"gherkins":"pickled cucumber",
"Noisette":"A French style bakery and brand of bread from Melbourne, Australia",
"couverture chocolate":"a very high-quality chocolate that contains a higher percentage of cocoa butter (32–39%) than baking or eating chocolate",
"goats cheese":"cheese made from goat's milk",
"ricotta salata":"an Italian cheese made from the whey part of sheep milk, which is pressed, salted and aged for at least 90 days",
"cilantro":"Spanish word for coriander",
"blanched":"having been briefly immersed in boiling water, especially in order to remove the skin or to prepare it for further cooking",
"caramelised":"(with reference to food containing natural sugar) cook or be cooked so as to develop the characteristic brown colour and nutty flavour of caramel",
"multigrain soldiers":"multigrain bread cut into long strips to resemble 'soldiers'",
"beef sujuk":"a dry spicy sausage made from ground beef",
"saganaki":"In Greek cuisine, saganaki is any one of a variety of dishes prepared in a small frying pan, the best-known being an appetizer of fried cheese",
"napoli":"Neapolitan sauce, also called Napoli sauce or Napoletana sauce, is the collective name given to various basic tomato-based sauces derived from Italian cuisine",
"sesame":"Sesame is a flowering plant in the genus Sesamum, also called benne",
"pain de mie":"Pain de mie is a type of soft, white or brown bread, mostly sold sliced and packaged",
"mozzarella":"Mozzarella is a traditionally southern Italian cheese made from Italian buffalo's milk by the pasta filata method",
"focaccia":"Focaccia is a flat oven-baked Italian bread product similar in style and texture to pizza dough",
"za'atar":"Za'atar as a prepared condiment is generally made with ground dried thyme, oregano, marjoram",
"muesli":"Müsli [ˈmyːsli] is a cold breakfast cereal dish based on rolled oats and ingredients like grains, nuts, seeds and fresh or dried fruits",
"honeycomb":"A honeycomb is a mass of hexagonal prismatic wax cells built by honey bees in their nests to contain their larvae and stores of honey and pollen",
"valentina":" is a brand of pourable hot sauce manufactured by Salsa Tamazula, a company in Guadalajara, Mexico.",
"morita":"smoked ripe jalapeños",
"crema":"sometimes referred to as crema espesa (English: \"thick cream\"), and referred to as crema fresca (English: \"fresh cream\") in Mexico, is a Mexican dairy product prepared with heavy cream and buttermilk.",
"rockling":"a slender marine fish of the cod family, typically occurring in shallow water or tidal pools.",
"tinga":"Chicken tinga is a Mexican dish made with shredded chicken in a sauce made from tomatoes, chipotle chilis in adobo, and sliced onions",
"ancho":"a large aromatic variety of chilli, used (usually dried) in dishes of Mexican origin or style.",
"midnight corn":"is several closely related varieties of flint corn grown in Mexico, the Southwestern United States, and the Southeastern United States.",
"pulparindo":"is the trade name of a Mexican candy produced by de la Rosa. The candy is made from the pulp of the tamarind fruit, and is flavored with sugar, salt, and chili peppers, making it simultaneously tart, sweet, salty, and spicy.",
"campechano":"Tacos campechanos are composed of several layers of flavors with several meats. The most common and popular taco campechano is a thinly sliced, milanesa-style beef marinated in a salty chile and spice marinade and then dried. ",
"ghost chili":"The Bhut jolokia also known as ghost pepper, ghost chili and ghost jolokia, is an interspecific hybrid chili pepper cultivated in the Northeast Indian states of Arunachal Pradesh, Assam, Nagaland and Manipur.The ghost chili is also execptionally hot, rated at more than 1 million Scoville heat units (SHUs).",
"taco-shop Guaca":"This creamy all-purpose salsa is great on tacos filled with carnitas or grilled cactus. This thinner version of classic guacamole is a purée of tomatillos and avocado, flavored with serrano chiles, onion, cilantro, and lime.",
"huitlacoche":"is edible fungus, and forms galls on all above-ground parts of corn species; which is eaten, usually as a filling, in quesadillas and other tortilla-based foods, and soups.",
"quesadilla":"a tortilla folded over a filling of shredded cheese, onions, and chilies and broiled or fried.",
"cascabel":"The cascabel chili (little bell), also known as the rattle chili, is one of the Mirasol cultivars of the species Capsicum annuum. Heat can be described as medium, and sits somewhere between 1,500-2,500 SHU (scoville scale).",
"veracruzana":"is a classic Mexican salsa that is an intriguing blend of fresh tomatoes, green olives, capers and with a slight kick of chile pepper.",
"Short ribs ":"are a cut of beef taken from the brisket, chuck, plate, or rib areas of beef cattle. They consist of a short portion of the rib bone, which is overlain by meat which varies in thickness.",
"añejo":"in English, can be defined as: matured or aged. Is often use to refer to tequila that has been aged, but can also be used to describe rum.",
"espuma":"In English, can be define as: Foam. It is the mass of bubbles that forms on the surface of some liquids.",
"raicilla":"Raicilla is a distilled spirit, originating in the south western portion of the Mexican state of Jalisco. Like tequila and mezcal, it is a product of the agave plant.",
"Jamaica":"is the fifth-largest island country in the Caribbean. The indigenous people, the Taíno, called it Xaymaca in Arawakan. meaning the \"Land of Wood and Water\" or the \"Land of Springs\".",
"Curaçao":"is a liqueur flavored with the dried peel of the Laraha citrus fruit (a bitter orange), grown on the island of Curaçao.",
"ceviche":"a dish made of raw fish marinated in lime or lemon juice often with oil, onions, peppers, and seasonings and sometimes served as a snack or appetizer.",
"caballero":"‘Mexican ranch’ - made with buttermilk, mustard, mayo",
"gherkin":"A small cucumber used especially for pickling and garnishing.",
"dukkha":"an Egyptian condiment consisting of a mixture of herbs, nuts, and spices",
"chevre":"French cheese made with goat's milk",
"casalinga":"Italian for homemade.",
"pane di casa":"a traditional Italian bread",
"cannellini beans":"Slightly kidney-shaped with squarish ends, and are creamy white in colour.",
"celeriac":"Celery root, a variety of celery cultivated for its fat, knobby root rather than its stalks",
"skordalia":"A classic Greek sauce of garlic, lemon, and nuts; in some versions, bread crumbs or potato purée is added",
"sherry":"A fortified blended wine, strictly speaking from a specified area around the city of Jerez in southern Spain",
"potato rosti":"fried grated potato",
"roe":"the fully ripe internal egg masses in the ovaries, or the released external egg masses of fish and certain marine animals",
"cornetto":"a branded frozen dessert cone ice cream",
"caper berries":"edible flower buds (capers), often used as a seasoning, and the fruit (caper berries), both of which are usually consumed pickled",
"porcini":"a type of mushroom",
"spaetzle":"small dumplings of a type made in southern Germany and Alsace, consisting of seasoned dough poached in boiling water",
"fondant":"French for an icing mixture used as a coating in confectionery and pastry.",
"bois boudran":"a French marinade sauce, best served over steak",
"marinières":"a sauce of white wine and onions served especially with mussels",
"du jour":"French for 'of the day'",
"sauce charcutière":"a compound French sauce consisting of a base of espagnole sauce with a flavouring of chopped gherkins. It is most frequently used with cuts of grilled or sautéed pork",
"bavette":"French for flank steak.",
"milawa duck":"a brand of duck",
"sugar plum":"a type of fruit that is full of rich, complex and appropriately confectionary sweet flavors that deepen as the fruit ripens",
"pork crackle":"rind with oil and salt the fat under the skin reacts. with the salt to make the skin crispier a very hot oven is essential for good crackling",
"citrus":"a tree of a genus that includes citron, lemon, lime, orange, and grapefruit",
"Pok choy":"a Chinese cabbage (Brassica rapa chinensis) forming an open head with long white stalks and green leaves.",
"hoi sin":"a thick reddish sauce of soybeans, spices, and garlic used in east Asian cookery",
"beetroot":"the edible dark red spherical root of a kind of beet, eaten as a vegetable",
"Padrón peppers":"are a variety of peppers (Capsicum annuum) from the municipality of Padrón in the province of A Coruña, Galicia, northwestern Spain. These are small, relatively mild peppers about 2 inches (5 cm) long, with a color ranging from bright green to yellowish green, and occasionally red.",
"hock":"The portion of the leg that is neither part of the ham proper nor the ankle or foot, but rather the extreme shank end of the leg bone. Somewhere from the knee to the ankle.",
"gyozas":"are dumplings filled with ground meat and vegetables and wrapped in a thin dough. The typical gyoza filling consists of ground pork, nira chives, green onion, cabbage, ginger, garlic, soy sauce and sesame oil",
"pappardelle":"Long flat egg noodles, ⅝ inch broad, cut with a crimped edge; they are the traditional accompaniment to hare cooked in a rich wine sauce; from Tuscany.",
"marrow jus":"gravy or sauce made from bone marrow",
"whitefish":"A small freshwater fish, mainly North American, related to TROUT and SALMON, with delicate white meat that tastes best in winter and is often smoked (see CISCO); the roe is used as a CAVIARsubstitute.",
"pak choy":"a type of Chinese cabbage. Chinensis varieties do not form heads and have smooth, dark green leaf blades instead, forming a cluster reminiscent of mustard greens or celery.",
"vincotto":"(translated as \"cooked wine\") is a dark, sweet, thick paste produced by country people in the Emilia Romagna, Veneto, Lombardy, Apulia, and Marche regions of Italy.",
"Pepe Saya":"a brand of butter from New South Wales, Australia",
"jack fruits":"a yellow tropical fruit, native to Southeast Asia; also used as a meat alternative due to its 'meat-like' texture when cooked",
"tare sauce":"a soy basting sauce in Japanese cuisine often used in grilling as well as with sushi, nabemono and gyoza.",
"roti prata":"an Indian-influenced flatbread dish found in several countries in Southeast Asia; also known as roti canai",
"cumquat":"a bite-sized citrus fruit, similar to an orange but golf ball sized; also known as kumquat",
"compressed":"the process of squeezing or pressing food",
"Oreo":"a brand of cookie usually consisting of two chocolate wafers with a sweet crème filling",
"ganache":"a glaze, icing, sauce, or filling for pastries made from chocolate and cream",
"Woodfrog":"name of a bakery in Melbourne",
"roquette":"another name for rocket, a type of leaf vegetable",
"lardons":"a chunk or cube of bacon used to lard meat"}
